Revit 2027 API
ElementLevelFilter.LevelId Property
 The id of the level that will be matched to elements' associated level.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId LevelId { get; }
Public ReadOnly Property LevelId As ElementId
	Get
public:
property ElementId^ LevelId {
	ElementId^ get ();
}
member LevelId : ElementId with get
Property Value
ElementId
See Also
Reference
ElementLevelFilter Class
Autodesk.Revit.DB Namespace